# Rebar Constraint Get Target Rebar Handle Behavior Method

Source: https://www.revitapidocs.com/2026/d291b8dc-e84a-2d4b-888f-bbbb45691b48.htm

---

| Rebar Constraint Get Target Rebar Handle Behavior Method |
| --- |

Gets the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached.
 The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public RebarHandleBehavior GetTargetRebarHandleBehavior()
```

```
Public Function GetTargetRebarHandleBehavior As RebarHandleBehavior
```

```
public:
RebarHandleBehavior GetTargetRebarHandleBehavior()
```

```
member GetTargetRebarHandleBehavior : unit -> RebarHandleBehavior
```

#### Return Value

RebarHandleBehavior
Returns the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached. Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid.  \-or\-  The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.  \-or\-  Constrained rebar isn't a shape driven rebar element. |

See Also

#### Reference

RebarConstraint Class Autodesk.Revit.DB.Structure Namespace